request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://com.example/webservice/generatedwsdl">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getCountryRequest>
         <gs:name>e1</gs:name>
      </gs:getCountryRequest>
   </soapenv:Body>
</soapenv:Envelope>